In [5]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [9]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [7]:
df.groupby("Department")["Age"].mean()

Department
HR           24.0
IT           26.0
Marketing    27.0
Sales        24.0
Name: Age, dtype: float64

In [9]:
df.groupby("Team")["Salary"].sum()

Team
A    175
B    163
C    180
D    155
Name: Salary, dtype: int64

In [11]:
df.groupby("Department")["Salary"].sum()

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [13]:
df.groupby("Department")["Salary"].min()

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

In [15]:
 df.groupby("Team")["Salary"].agg(["mean","max","min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [17]:
type(df.groupby("Team")["Salary"].agg(["mean","max","min"]))

pandas.core.frame.DataFrame

In [15]:
df.groupby("Team")["Salary"].agg(avg_score = "mean",high_score="max")#customize column name

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [17]:
#.agg & .aggreagte is same

In [19]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")

In [21]:
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [23]:
df.groupby("Team").filter(lambda x:x["Salary"].mean() > 85)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0

## Merging & Joining Data

In [26]:
 employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [28]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [32]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [36]:
pd.merge(employees,departments,on="DeptID") ## Inner Join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [44]:
pd.merge(employees,departments,on="DeptID",how="left") #Left Join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [46]:
pd.merge(employees,departments,on="DeptID",how="right")#Right Join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [54]:
pd.merge(employees,departments,on="DeptID",how="outer") #just like full join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [72]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"score":[343,52]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"age":[43,53]})

In [58]:
df1

    Name
0  Alice
1    Bob

In [60]:
df2

      Name
0  Charlie
1    David

In [74]:
pd.concat([df1,df2]) #vertically

      Name  score   age
0    Alice  343.0   NaN
1      Bob   52.0   NaN
0  Charlie    NaN  43.0
1    David    NaN  53.0

In [76]:
pd.concat([df1,df2],axis=1) #Horizontally

    Name  score     Name  age
0  Alice    343  Charlie   43
1    Bob     52    David   53

## Working With CSVs

In [83]:
df = pd.read_csv("datatwo.csv")

In [85]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Vikciy Koushal,xxyz,2023,Action,1050,7.2
1,Jitu Bhaiya,Tiger Zinda Hai,2017,Action,565,6.0
2,JK shah,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [89]:
df= df[df['IMDb']>6.5]

In [91]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Vikciy Koushal,xxyz,2023,Action,1050,7.2
2,JK shah,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [95]:
df.to_csv("data_updated.csv") #give with index

In [97]:
df.to_csv("data_updated_new.csv",index=False) #without index

## Write Exceel

In [106]:
df.to_excel("output.xlsx", index=False)

### Multiple Sheets

In [109]:
'''
with pd.ExcelWriter("report.xlsx") as writer:
    df1.to_excel(writer, sheet_name="Summary", index=False)
    df2.to_excel(writer, sheet_name="Details", index=False)
    '''

'\nwith pd.ExcelWriter("report.xlsx") as writer:\n    df1.to_excel(writer, sheet_name="Summary", index=False)\n    df2.to_excel(writer, sheet_name="Details", index=False)\n    '

## JSON Files

In [ ]:
df=pd.read_json("jsod3.json")

In [118]:
## For Normalize Data
df = pd.json_normalize(data)

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Vikciy Koushal,xxyz,2023,Action,1050,7.2
2,JK shah,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2